NikolayBobovnikov/ircapture/auvir_embed/stm32_cmake/stm32test-HAL/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2015 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#include <string.h>
#include <math.h>
#include "I2Cdev.h"
#include "MPU6050.h"

#define DEBUG
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
typedef struct
{
    int16_t Accelerometer_X;
    int16_t Accelerometer_Y;
    int16_t Accelerometer_Z;
    int16_t Temperature;
    int16_t Gyroscope_X;
    int16_t Gyroscope_Y;
    int16_t Gyroscope_Z;
    uint32_t delta_time;
    float angle_x;
    float angle_y;
    float angle_z;

} MPU6050_MotionData_t;

typedef struct
{
    int mean_ax;
    int mean_ay;
    int mean_az;
    int mean_gx;
    int mean_gy;
    int mean_gz;
    int var_ax;
    int var_ay;
    int var_az;
    int var_gx;
    int var_gy;
    int var_gz;
    // TODO: offsets
    int16_t offset_ax;
    int16_t offset_ay;
    int16_t offset_az;
    int16_t offset_gx;
    int16_t offset_gy;
    int16_t offset_gz;
} MPU6050_CalibrationData_t;

enum UART_Commands {
    UART_COMMAND_NOT_RECEIVED = 0,
    UART_REQUEST_SEND,
    UART_REQUEST_STOP,
    UART_REQUEST_SEND_BYTE,
    UART_REQUEST_SEND_MPU6050_TEST_DATA,
    UART_REQUEST_SEND_MPU6050_DATA,
    UART_REQUEST_CALIB_DATA,

    UART_TEST_CONNECTION,			// request
    UART_CONNECTION_FAILURE,
    UART_CONENCTION_OK,

    UART_MPU6050_TEST_CONNECTION,	// request
    UART_MPU6050_CONENCTION_FAILURE,
    UART_MPU6050_CONENCTION_OK,
    UART_NULL_RESPONSE,

    UART_MPU6050_RESET,              // request
    UART_MPU6050_RESET_OK,
    UART_MPU6050_RESET_FAILURE
};

static MPU6050_MotionData_t motion_data;
static MPU6050_CalibrationData_t calibration_data;
static uint8_t motion_data_buffer[sizeof(MPU6050_MotionData_t)];
const size_t max_string_lengh = 127;

// TODO: define frequency automatically based on chip name (thus based on #defined symbol like STM32F100xB)
// Values to define constants. Are not to be used in application code
#define CHIP_FREQUENCY    24000000
//Timer setup. timer frequency = (chip frequency / prescaler) = (24Mhz / 24) = 1 Mhz 1*10^6
#define TIMER_PRESCALER     24000
#define TIMER_RESET_PERIOD  1000


// Constants to use in code
const int chip_frequency = CHIP_FREQUENCY;
const int timer_prescaler =  TIMER_PRESCALER;
const int timer_reset_period = TIMER_RESET_PERIOD;
const float timer_frequency = (float)((float)(CHIP_FREQUENCY) / (float)(TIMER_PRESCALER));
const float seconds_per_timer_tick = (float)((float)(TIMER_PRESCALER) / (float)(CHIP_FREQUENCY));

// These variables are private, used in MPU6050_GetAllData(), don't use them directly.
// Use MPU6050_ResetCalculatedData() to init them to default values before using sensor
#define FILTER_DEFAULT_VALUE   0.95
float filter_gain = FILTER_DEFAULT_VALUE;
float timeStep;
bool  is_firts_sample = true;
float acc_angle_x = 0.0;
float acc_angle_y = 0.0;
float acc_angle_z = 0.0;
float gyro_angular_x = 0.0;
float gyro_angular_y = 0.0;
float gyro_angular_z = 0.0;
float gyro_integrated_angle_x = 0.0;
float gyro_integrated_angle_y = 0.0;
float gyro_integrated_angle_z = 0.0;
// *

#define PI 3.14159265358979323846
static const float radian = 180 / PI;
static const int gyroScale = 131;


//Change this 3 variables if you want to fine tune the skecth to your needs.
static const int number_of_samples=200;     //Amount of readings used to average, make it higher to get more precision but sketch will be slower  (default:1000)
static const int acel_deadzone=50;     //Acelerometer error allowed, make it lower to get more precision, but sketch may not converge  (default:8)
static const int gyro_deadzone=10;     //Giro error allowed, make it lower to get more precision, but sketch may not converge  (default:1)

static int16_t ax, ay, az,gx, gy, gz;
static int state=0;


#define LED_PIN GPIO_PIN_8
#define LED_PORT GPIOC

/* USER CODE END PV */

