NikolayBobovnikov/ircapture/auvir_embed/stm32_cmake/stm32test-HAL/Src/main.c
    RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;

    //Transmit register - pin 9
    //MODE: 11: Output mode, max speed 50 MHz.
    GPIOA->CRH |= GPIO_CRH_MODE9;

    //10: Alternate function output Push-pull
    GPIOA->CRH &= (~GPIO_CRH_CNF9);
    GPIOA->CRH |= GPIO_CRH_CNF9_1;

    //Receive register - pin 10
    // MODE: 00: Input mode (reset state)
    GPIOA->CRH &= (~GPIO_CRH_MODE10);
    // CNF: 01: Floating input (reset state)
    GPIOA->CRH &= (~GPIO_CRH_CNF10);
    GPIOA->CRH |= GPIO_CRH_CNF10_0;


    /* Initialize uart peripheral*/

    RCC->APB2ENR |= RCC_APB2ENR_IOPAEN | RCC_APB2ENR_USART1EN;
    //1. Enable the USART by writing the UE bit in USART_CR1 register to 1.
    USART1->CR1 |= USART_CR1_UE;                // Uart Enable
    //2. Program the M bit in USART_CR1 to define the word length.
    USART1->CR1 &= (~USART_CR1_M);              // 8 bit word - bit M is reset
    //3. Program the number of stop bits in USART_CR2.
    USART1->CR2 &= (~USART_CR2_STOP);           // 1 stop bit - 00
    /*4. Select DMA enable (DMAT) in USART_CR3 if Multi buffer Communication is to take
    place. Configure the DMA register as explained in multibuffer communication.*/
    USART1->CR3 &= (~USART_CR3_DMAT);           // DMA disabled
    //5. Select the desired baud rate using the USART_BRR register.
    USART1->BRR = (SystemCoreClock / 115200);   //9600 or 115200 bps
    //6. Set the TE bit in USART_CR1 to send an idle frame as first transmission.
    USART1->CR1 |= USART_CR1_TE;

}
bool usart_send_str_ok(const char *input)
{
    char string[max_string_lengh + 1];
    strncpy(string, input, sizeof(string));   // copy input without exceeding the length of the destination
    string[sizeof(string) - 1] = '\0';        // if strlen(input) = sizeof(str) then strncpy won't NUL terminate
    size_t bytes_to_sent = strlen(string) + 1; // length of input string + 1 if it is less than max_string_lengh; max_string_lengh otherwise

    // TODO: study signed/unsigned conversion below
    HAL_StatusTypeDef trans = HAL_UART_Transmit(&huart1, (uint8_t*) string, bytes_to_sent, 1000);
    if(HAL_OK == trans)
    {
        return true;
    }
    return false;
}
void usart_send_str(const char *input)
{
    usart_send_str_ok(input);
}
int ipow(int base, int exp)
{
    int result = 1;
    while (exp)
    {
        if (exp & 1)
            result *= base;
        exp >>= 1;
        base *= base;
    }

    return result;
}
int square(int base)
{
    return ipow(base, 2);
}
void MPU6050_getAllData()
{
    // get time of arrival (number of timer ticks)
    motion_data.delta_time = __HAL_TIM_GET_COUNTER(&htim4);
    // get new data to buffer
    I2Cdev_readBytes(MPU6050_ADDRESS_AD0_LOW, MPU6050_RA_ACCEL_XOUT_H, 14, motion_data_buffer, 100);
    // reset timer
    __HAL_TIM_SET_COUNTER(&htim4, 0);
    //HAL_Delay(1);

    // fill struct from buffer
    motion_data.Accelerometer_X = (((int16_t)motion_data_buffer[0]) << 8) | motion_data_buffer[1];
    motion_data.Accelerometer_Y = (((int16_t)motion_data_buffer[2]) << 8) | motion_data_buffer[3];
    motion_data.Accelerometer_Z = (((int16_t)motion_data_buffer[4]) << 8) | motion_data_buffer[5];
    motion_data.Temperature     = (((int16_t)motion_data_buffer[6]) << 8) | motion_data_buffer[7];
    motion_data.Gyroscope_X     = (((int16_t)motion_data_buffer[8]) << 8) | motion_data_buffer[9];
    motion_data.Gyroscope_Y     = (((int16_t)motion_data_buffer[10])<< 8) | motion_data_buffer[11];
    motion_data.Gyroscope_Z     = (((int16_t)motion_data_buffer[12])<< 8) | motion_data_buffer[13];

#ifdef DEBUG
    float T = (motion_data.Temperature/340 + 36.53);
#endif
    // delta t
    timeStep = (float) motion_data.delta_time * seconds_per_timer_tick;

    // apply gyro scale from datasheet
    gyro_angular_x = motion_data.Gyroscope_X / gyroScale;
    gyro_angular_y = motion_data.Gyroscope_Y / gyroScale;
    gyro_angular_z = motion_data.Gyroscope_Z / gyroScale;

    // calculate accelerometer angles
    // TODO: profile; compare to LUT implementations of atan and probably others
    acc_angle_x = atan(motion_data.Accelerometer_X / sqrt(square(motion_data.Accelerometer_Y) + square(motion_data.Accelerometer_Z)));
    acc_angle_y = atan(motion_data.Accelerometer_Y / sqrt(square(motion_data.Accelerometer_X) + square(motion_data.Accelerometer_Z)));
    acc_angle_z = atan(sqrt(square(motion_data.Accelerometer_Y) + square(motion_data.Accelerometer_X)) / motion_data.Accelerometer_Z);

    acc_angle_x *= radian;
    acc_angle_y *= radian;
    acc_angle_z *= radian;

    // set initial values equal to accel values
    if (is_firts_sample)
    {
        is_firts_sample = false;
        gyro_integrated_angle_x = acc_angle_x;
        gyro_integrated_angle_y = acc_angle_y;
        gyro_integrated_angle_z = acc_angle_z;
    }
    // integrate to find the gyro angle
    else
    {
        gyro_integrated_angle_x = gyro_integrated_angle_x + (timeStep * gyro_angular_x);
        gyro_integrated_angle_y = gyro_integrated_angle_y + (timeStep * gyro_angular_y);
        gyro_integrated_angle_z = gyro_integrated_angle_z + (timeStep * gyro_angular_z);
    }

    // apply filter
    motion_data.angle_x = ((1-filter_gain) * acc_angle_x) + (filter_gain * gyro_integrated_angle_x);
    motion_data.angle_y = ((1-filter_gain) * acc_angle_y) + (filter_gain * gyro_integrated_angle_y);
    motion_data.angle_z = ((1-filter_gain) * acc_angle_z) + (filter_gain * gyro_integrated_angle_z);

}

void usart_wait_exec_loop()
{
    HAL_StatusTypeDef status;
    while( 1 )
    {
        //reset command
        uint8_t command = UART_COMMAND_NOT_RECEIVED;
        uint8_t response = UART_NULL_RESPONSE;
        status = HAL_UART_Receive(&huart1, &command, 1, 1000);

        // if received command, dispatch it
        if(status == HAL_OK && UART_COMMAND_NOT_RECEIVED != command)
        {
            if(UART_REQUEST_SEND_MPU6050_DATA == command)
            {
                MPU6050_getAllData();
                HAL_StatusTypeDef status = HAL_UART_Transmit(&huart1, (uint8_t*)&motion_data, sizeof(motion_data), 1000);
                if(status != HAL_OK)
                {
                    // TODO: process error
                }
            }
            else if(UART_REQUEST_SEND_MPU6050_TEST_DATA == command)
            {
                motion_data.Accelerometer_X = 1;
                motion_data.Accelerometer_Y = 2;
                motion_data.Accelerometer_Z = 3;
                motion_data.Temperature    = 4;
                motion_data.Gyroscope_X    = 5;
                motion_data.Gyroscope_Y    = 6;
                motion_data.Gyroscope_Z    = 7;
                status = HAL_UART_Transmit(&huart1, (uint8_t*)&motion_data, sizeof(motion_data), 1000);
            }
            else if (UART_REQUEST_CALIB_DATA == command)
            {
                meansensors();
                calibration();
                meansensors();

