NikolayBobovnikov/ircapture/auvir_embed/stm32_cmake/stm32test-HAL/Src/main.c
        mean_ax_prev = calibration_data.offset_ax;
        mean_ay_prev = calibration_data.offset_ay;
        mean_az_prev = calibration_data.offset_az;
        mean_gx_prev = calibration_data.offset_gx;
        mean_gy_prev = calibration_data.offset_gy;
        mean_gz_prev = calibration_data.offset_gz;

        meansensors();

        if (abs(calibration_data.mean_ax)<= acel_deadzone) ready++ ;
        else
        {
            if (calibration_data.mean_ax < mean_ax_prev)
            {
                calibration_data.offset_ax = calibration_data.offset_ax + calibration_data.mean_ax / acel_deadzone;
            }
            else
            {
                calibration_data.offset_ax = calibration_data.offset_ax - calibration_data.mean_ax / acel_deadzone;
            }
            mean_ax_prev = calibration_data.mean_ax;
        }

        if (abs(calibration_data.mean_ay)<= acel_deadzone) ready++ ;
        else
        {
            //calibration_data.offset_ay = calibration_data.offset_ay - calibration_data.mean_ay / acel_deadzone;
            if (calibration_data.mean_ay < mean_ay_prev)
            {
                calibration_data.offset_ay = calibration_data.offset_ay + calibration_data.mean_ay / acel_deadzone;
            }
            else
            {
                calibration_data.offset_ay = calibration_data.offset_ay - calibration_data.mean_ay / acel_deadzone;
            }
            mean_ay_prev = calibration_data.mean_ay;
        }


        if (abs(16384 - calibration_data.mean_az)<= acel_deadzone) ready++ ;
        else
        {
            //calibration_data.offset_az = calibration_data.offset_az + (16384 - calibration_data.mean_az) / acel_deadzone;
            if (calibration_data.mean_az < mean_az_prev)
            {
                calibration_data.offset_az = calibration_data.offset_az + (calibration_data.mean_az - 16384) / acel_deadzone;
            }
            else
            {
                calibration_data.offset_az = calibration_data.offset_az - (calibration_data.mean_az - 16384) / acel_deadzone;
            }
            mean_az_prev = calibration_data.mean_az;
        }

        if (abs(calibration_data.mean_gx)<= gyro_deadzone) ready++ ;
        else
        {
            if (calibration_data.mean_gx < mean_gx_prev)
            {
                calibration_data.offset_gx = calibration_data.offset_gx + calibration_data.mean_gx / gyro_deadzone;
            }
            else
            {
                calibration_data.offset_gx = calibration_data.offset_gx - calibration_data.mean_gx / gyro_deadzone;
            }
            mean_gx_prev = calibration_data.mean_gx;
        }

        if (abs(calibration_data.mean_gy)<= gyro_deadzone) ready++ ;
        else
        {
            if (calibration_data.mean_gy < mean_gy_prev)
            {
                calibration_data.offset_gy = calibration_data.offset_gy + calibration_data.mean_gy / gyro_deadzone;
            }
            else
            {
                calibration_data.offset_gy = calibration_data.offset_gy - calibration_data.mean_gy / gyro_deadzone;
            }
            mean_gy_prev = calibration_data.mean_gy;
        }

        if (abs(calibration_data.mean_gz)<= gyro_deadzone) ready++ ;
        else
        {
            if (calibration_data.mean_gz < mean_gz_prev)
            {
                calibration_data.offset_gz = calibration_data.offset_gz + calibration_data.mean_gz / gyro_deadzone;
            }
            else
            {
                calibration_data.offset_gz = calibration_data.offset_gz - calibration_data.mean_gz / gyro_deadzone;
            }
            mean_gz_prev = calibration_data.mean_gz;
        }

        if (ready == 6) break;

    }
}

void MPU6050_ResetCalculatedData()
{
    memset(&motion_data, 0, sizeof(motion_data));
    filter_gain = FILTER_DEFAULT_VALUE;
    is_firts_sample = true;
    timeStep= seconds_per_timer_tick;
    gyro_integrated_angle_x = 0.0;
    gyro_integrated_angle_y = 0.0;
    gyro_integrated_angle_z = 0.0;
}
/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
    /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
    /* USER CODE END 6 */

}

#endif

/**
  * @}
  */

/**
  * @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
